<a href="https://colab.research.google.com/github/MeilinPy95/Machine-Learning/blob/main/NO1_UTS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
path="/content/drive/My Drive/machine learning/2020 Indonesian University Ranking.csv"
dataset=pd.read_csv(path)
dataset

     Rank                        University              Town
0       1           Universitas Gadjah Mada            Sleman
1       2             Universitas Indonesia             Depok
2       3            Universitas Diponegoro          Semarang
3       4  Universitas Pendidikan Indonesia           Bandung
4       5     Universitas Negeri Yogyakarta            Sleman
..    ...                               ...               ...
572   573                Universitas Timika            Timika
573   574                  Universitas Nuku  Tidore Kepulauan
574   575      Universitas Pepabri Makassar          Makassar
575   576     Universitas Sulawesi Tenggara           Kendari
576   577       Universitas Kristen Tentena              Poso

[577 rows x 3 columns]

In [3]:
x=dataset[['Rank','University']]
y=dataset['Town']

In [4]:
x

     Rank                        University
0       1           Universitas Gadjah Mada
1       2             Universitas Indonesia
2       3            Universitas Diponegoro
3       4  Universitas Pendidikan Indonesia
4       5     Universitas Negeri Yogyakarta
..    ...                               ...
572   573                Universitas Timika
573   574                  Universitas Nuku
574   575      Universitas Pepabri Makassar
575   576     Universitas Sulawesi Tenggara
576   577       Universitas Kristen Tentena

[577 rows x 2 columns]

In [5]:
y

0                Sleman
1                 Depok
2              Semarang
3               Bandung
4                Sleman
             ...
572              Timika
573    Tidore Kepulauan
574            Makassar
575             Kendari
576                Poso
Name: Town, Length: 577, dtype: object

In [6]:
from sklearn.model_selection import train_test_split

In [7]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.7)

In [14]:
x_train

     Rank                           University
238   239               Universitas Pancasakti
378   379   Universitas Mohammad Husni Thamrin
444   445                  Universitas Quality
436   437               Universitas Darwan Ali
35     36       Universitas Jenderal Soedirman
..    ...                                  ...
498   499             Universitas Bandung Raya
345   346        Universitas Abdurachman Saleh
55     56  Universitas Muhammadiyah Purwokerto
133   134       Universitas Al Azhar Indonesia
57     58       Universitas Pendidikan Ganesha

[173 rows x 2 columns]

In [15]:
x_test

     Rank                                   University
153   154                         Universitas Kuningan
89     90                         Universitas Semarang
110   111                Universitas AMIKOM Yogyakarta
19     20                          Universitas Andalas
542   543                        Universitas San Pedro
..    ...                                          ...
553   554              Universitas Nani Bili Nusantara
70     71                Universitas Lambung Mangkurat
0       1                      Universitas Gadjah Mada
290   291                        Universitas Al Muslim
376   377  Universitas Graha Nusantara Padangsidimpuan

[404 rows x 2 columns]

In [16]:
y_train

238        Tegal
378      Jakarta
444        Medan
436       Sampit
35      Banyumas
         ...
498      Bandung
345    Situbondo
55      Banyumas
133      Jakarta
57     Singaraja
Name: Town, Length: 173, dtype: object

In [17]:
y_test

153           Kuningan
89            Semarang
110             Sleman
19              Padang
542             Kupang
            ...
553              Aimas
70         Banjarmasin
0               Sleman
290            Bireuen
376    Padangsidimpuan
Name: Town, Length: 404, dtype: object